# Напишите функцию rectangle_area(width, height), 
# которая вычисляет и возвращает площадь прямоугольника.

def rectangle_area(width, height):
    print(f'Площадь прямоугольника: {width * height}')
rectangle_area(int(input()), int(input()))